cask_args appdir: '/Applications'

brew 'asdf'
brew 'awscli'
brew 'git'
brew 'git-lfs'
brew 'gh'
brew 'gnupg'
brew 'jq'
brew 'pinentry-mac'
brew 'the_silver_searcher'
brew 'wget'
brew 'neovim'
brew 'zsh'
brew 'tmux'
brew 'starship'
brew 'coreutils'

# Neovim dependencies
brew 'ripgrep'
brew 'fd'
brew 'ast-grep'
brew 'lazygit'
brew 'fzf'

cask 'visual-studio-code'
cask 'fantastical'
cask 'istat-menus'
cask 'mimestream'
cask 'iterm2'
cask 'bbedit'
cask 'roon'
cask 'google-drive'
cask 'google-chrome'
cask 'tailscale-app'
cask 'xcodes-app'
cask 'steermouse'
cask 'secretive'
cask 'scroll-reverser'
cask 'visual-studio-code'

cask 'font-sf-mono'
cask 'font-iosevka'
cask 'font-iosevka-term-nerd-font'
