cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'asdf'
brew 'awscli'
brew 'colima'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'git'
brew 'gnupg'
brew 'jq'
brew 'pinentry-mac'
brew 'the_silver_searcher'
brew 'wget'
brew 'neovim'
brew 'zsh'
brew 'tmux'
brew 'starship'
brew 'asimov'

cask 'raycast'
cask 'visual-studio-code'
cask 'fantastical'
cask 'istat-menus'
cask 'mimestream'
cask 'iterm2'
cask 'soundsource'
cask 'bbedit'
cask 'discord'
cask 'roon'
cask 'google-drive'
cask 'slack'
cask 'google-chrome'
cask 'tailscale'
cask 'xcodes'
cask 'steermouse'
cask 'secretive'

cask 'font-sf-mono'
cask 'font-iosevka'
cask 'font-iosevka-term-nerd-font'
